In [6]:
# Module 4.4.3 - Load and Read CSV Files
# Load CSV file - Add dependency first

In [7]:
# Add the Pandas dependency.
import pandas as pd

In [8]:
# Module 4.4.3 - Load and Read CSV Files
# Declare two variables: one assigned to the schools_complete.csv file and one assigned to the students_complete.csv file.
# (These files are located in the Resources folder.) 
# Files to load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [9]:
# Module 4.4.3 - Load and Read CSV Files
# Previously, we used the pd.DataFrame() function to convert a list of dictionaries, as we have in these CSV files. 
# The read_csv() function makes it easier for us by converting the CSV file to a DataFrame.
# Read the Schoold Data file
# Read the school data file and store it in a Pandas DataFrame.
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [10]:
# To view the first five rows of a DataFrame, use the df.head() method after the DataFrame name. 
# To view the last five rows of a DataFrame, use the df.tail() method after the DataFrame name.
# To view any number of rows in a DataFrame, place a number inside the parentheses.
# For the above DataFrame, the code looks like this.
school_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [11]:
# Module 4.4.3 cont'd
# Read the Student Data File (Note we read the School Data file above)
# Now we'll read the student data file and store it in a Pandas DataFrame
# Read the student data file and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [12]:
# Module 4.5.1 - Findng Missing Values
# To determine whether there are missing values in large datasets, use the following Pandas methods 
# the count() method,  isnull() method, and  notnull() method.

In [13]:
# Module 4.5.1 - Count() Method
# With the count() method, we can get a count of the rows for each column containing data. By default, "null" values are not counted, so you can often quickly identify which columns have missing data.
# Use the count() method on the school_data_df DataFrame.
# Determine if there are any missing values in the SCHOOLD DATA
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [14]:
# Module 4.5.1 - Count() Method cont'd
# Use the count() method on the student_data df DataFrame
# Determine if there are any missing values in the STUDENT DATA
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [15]:
# Module 4.5.1 - The isnull() Method
# The Pandas library also has the isnull() method for determining empty rows. 
# When you apply the isnull() method to a column, Series, or a DataFrame, a Boolean value will be returned, either "True" for the row or rows that are empty, i.e., null,
# or "False" for the rows that are not empty.
# Use the isnull() method on the school_data_df DataFrame.
# Determine if there are any missing values in the school data.
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [16]:
# Module 4.5.1 - The isnull() Method
# Now we'll use the same method on the student_data_df DataFrame.
# Determine if there are any missing values in the student data.
student_data_df.isnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
39165,False,False,False,False,False,False,False
39166,False,False,False,False,False,False,False
39167,False,False,False,False,False,False,False
39168,False,False,False,False,False,False,False
39169,False,False,False,False,False,False,False

In [17]:
# Module 4.5.1 - Using the Sum() Method after the Isnull() Method
# he process of joining two or more methods or functions together that are separated by a period is called chaining.
# To get the total number of empty rows, or rows that are "True," we can use the Pandas sum() method after the isnull() method, like this:
# Determine if there are any missing values in the student data.
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [18]:
# Module 4.5.1 - The notnull() Method
# When you apply the notnull() method to a column, Series, or a DataFrame, a Boolean will be returned: 
# "True" for the row or rows that are NOT empty, or "False" for the row or rows that are empty
# use the notnull() method on the school_data_df DataFrame. Run the following code:
# Determine if there are not any missing values in the school data.
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [19]:
# Module 4.5.1 - The notnull() Methhod
# Determine if there are not any missing values in the student data.
student_data_df.notnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True
...,...,...,...,...,...,...,...
39165,True,True,True,True,True,True,True
39166,True,True,True,True,True,True,True
39167,True,True,True,True,True,True,True
39168,True,True,True,True,True,True,True
39169,True,True,True,True,True,True,True

In [20]:
# Module 4.5.1 - Using the sum() Method after the notnull() Method
# Likee did with the student_data_df DataFrame, we can chain the notnull() method and the sum() method to get the sum of all the columns that are "True."
# Determine if there are not any missing values in the student data.
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [21]:
# Module 4.5.7 - Fix the Students2019 Names
# Switched from cleaning_data.ipynb file to PyCitySchools.ipynb file for this module
# Reference 4.5.6 in the cleaning_student_name.ipynb. For the previous data-cleaning step, we created a list to hold the common prefixes and suffixes as strings like this:
# prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]
# Similar to the code we used in the cleaning_student_names.ipynb file.

# load and read student_data
student_data_to_load = "Resources/students_complete.csv"
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

# Initialize the list
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

# Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

<ipython-input-21-da99836e2b1a>:20: FutureWarning: The default value of regex will change from True to False in a future version.
  student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

In [22]:
# Module 4.7.1 - Merge DataFrames
# In order to get all of this data organized in one table, we'll need to merge the two DataFrames and perform analysis 
# on the single, merged DataFrame. 
# Although we'll be merging the DataFrames, it may be more efficient to use either school_data_df or student_data_df when performing certain calculations.
# It's a best practice to create a new DataFrame to do calculations.